package ua.step.homework1;

/**
 * Написать и протестировать методы работы с квадратными матрицами (матрицы
 * представить в виде двухмерных массивов). 
 * Должны присутствовать методы: •
 * создания единичной (диагональной) матрицы 
 * • создания нулевой матрицы 
 * • сложение матриц 
 * • умножения матриц 
 * • умножение матрицы на скаляр 
 * • определение детерминанта матрицы 
 * • вывод матрицы на консоль
 *
 * 
 */
public class Task01 {
	public static void main(String[] args) {
		
	}
}
